---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AlignmentStationLabelSetInterval
source: html/aa88f941-5587-9568-3b2d-1b26708e063e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AlignmentStationLabelSetInterval Property

"Alignment Station Label Set Interval": The text is not used directly anywhere in the UI,
 instead the XAML specifies its own string for the value's label.

## Syntax (C#)
```csharp
public static ForgeTypeId AlignmentStationLabelSetInterval { get; }
```